import json

import pytest

from src.services import cashback_benefits, investment_bank, name_search, phone_search, simple_search


@pytest.mark.parametrize(
    "year, month, result",
    [(2021, 12, {"Супермаркеты": 1.0, "Каршеринг": 0.0}), (2019, 7, {"Рестораны": 4.0, "": 0.0, "Пополнения": 0.0})],
)
def test_cashback_benefits(transactions_test: list[dict], year: int, month: int, result: dict) -> None:
    """Тестирование функции cashback_benefits"""

    assert json.loads(cashback_benefits(transactions_test, year, month)) == result


@pytest.mark.parametrize("month, limit, result", [("2021-12", 50, 15.51), ("2019-07", 50, 150.0)])
def test_investment_bank(transactions_test: list[dict], month: str, limit: int, result: float) -> None:
    """Тестирование функции investment_bank"""

    assert investment_bank(month, transactions_test, limit) == result


@pytest.mark.parametrize(
    "search_word, result",
    [
        ("ИКЕА", []),
        (
            "Супермаркеты",
            [
                {
                    "MCC": None,
                    "Бонусы (включая кэшбэк)": 0.0,
                    "Валюта операции": "RUB",
                    "Валюта платежа": "RUB",
                    "Дата операции": "26.09.2021 17:08:10",
                    "Дата платежа": "26.09.2021",
                    "Категория": "Супермаркеты",
                    "Кэшбэк": 0.0,
                    "Номер карты": "*7197",
                    "Округление на инвесткопилку": 0.0,
                    "Описание": "Магнит",
                    "Статус": "OK",
                    "Сумма операции": -51.99,
                    "Сумма операции с округлением": 51.99,
                    "Сумма платежа": -51.99,
                },
                {
                    "MCC": None,
                    "Бонусы (включая кэшбэк)": 0.0,
                    "Валюта операции": "RUB",
                    "Валюта платежа": "RUB",
                    "Дата операции": "26.09.2021 13:32:29",
                    "Дата платежа": "26.09.2021",
                    "Категория": "Супермаркеты",
                    "Кэшбэк": 0.0,
                    "Номер карты": "*7197",
                    "Округление на инвесткопилку": 0.0,
                    "Описание": "Колхоз",
                    "Статус": "OK",
                    "Сумма операции": -90.41,
                    "Сумма операции с округлением": 90.41,
                    "Сумма платежа": -90.41,
                },
            ],
        ),
        (
            "Магнит",
            [
                {
                    "MCC": None,
                    "Бонусы (включая кэшбэк)": 0.0,
                    "Валюта операции": "RUB",
                    "Валюта платежа": "RUB",
                    "Дата операции": "26.09.2021 17:08:10",
                    "Дата платежа": "26.09.2021",
                    "Категория": "Супермаркеты",
                    "Кэшбэк": 0.0,
                    "Номер карты": "*7197",
                    "Округление на инвесткопилку": 0.0,
                    "Описание": "Магнит",
                    "Статус": "OK",
                    "Сумма операции": -51.99,
                    "Сумма операции с округлением": 51.99,
                    "Сумма платежа": -51.99,
                }
            ],
        ),
    ],
)
def test_simple_search(search_examples: list[dict], search_word: str, result: list[dict]) -> None:
    """Тестирование функции simple_search"""

    assert json.loads(simple_search(search_examples, search_word)) == result


def test_name_search(search_examples: list[dict]) -> None:
    """Тестирование функции name_search"""

    assert json.loads(name_search(search_examples)) == [
        {
            "MCC": None,
            "Бонусы (включая кэшбэк)": 0.0,
            "Валюта операции": "RUB",
            "Валюта платежа": "RUB",
            "Дата операции": "30.12.2021 22:22:03",
            "Дата платежа": "31.12.2021",
            "Категория": "Переводы",
            "Кэшбэк": 0.0,
            "Номер карты": "",
            "Округление на инвесткопилку": 0.0,
            "Описание": "Константин Л.",
            "Статус": "OK",
            "Сумма операции": -20000,
            "Сумма операции с округлением": 20000.0,
            "Сумма платежа": -20000,
        },
        {
            "MCC": None,
            "Бонусы (включая кэшбэк)": 0.0,
            "Валюта операции": "RUB",
            "Валюта платежа": "RUB",
            "Дата операции": "29.09.2021 09:10:13",
            "Дата платежа": "29.09.2021",
            "Категория": "Переводы",
            "Кэшбэк": 0.0,
            "Номер карты": "",
            "Округление на инвесткопилку": 0.0,
            "Описание": "Олеся М.",
            "Статус": "OK",
            "Сумма операции": -1000,
            "Сумма операции с округлением": 1000.0,
            "Сумма платежа": -1000,
        },
    ]


def test_phone_search(search_examples: list[dict]) -> None:
    """Тестирование функции phone_search"""

    assert json.loads(phone_search(search_examples)) == [
        {
            "MCC": None,
            "Бонусы (включая кэшбэк)": 0.0,
            "Валюта операции": "RUB",
            "Валюта платежа": "RUB",
            "Дата операции": "29.09.2021 18:48:24",
            "Дата платежа": "29.09.2021",
            "Категория": "Мобильная связь",
            "Кэшбэк": 0.0,
            "Номер карты": "",
            "Округление на инвесткопилку": 0.0,
            "Описание": "Я МТС +7 921 11-22-33",
            "Статус": "OK",
            "Сумма операции": -100,
            "Сумма операции с округлением": 100.0,
            "Сумма платежа": -100,
        }
    ]
